<?
   $info = array("강남","남서울","동서울","수원","수원2","수원2추가",
					"수원지하","양산","이천","이천추가","장성","장성추가","제주","푸드빌","SPC","spc","동원시화","동원이천","신세계"
					,"아워홈","광주","김해","왜관","용인","웰평","경인1","경인2","미트박스","성남","영남","평택","현대","호남","기타출고","외식");

   $infomapping = array("RS","RS","RS","CJ","CJ","CJ",
					"CJ","CJ","CJ","CJ","CJ","CJ","CJ","CJ","SPC","SPC","동원","동원","신세계"
					,"아워홈","웰스토리","웰스토리","웰스토리","웰스토리","웰스토리","현대","현대","현대","현대","현대","현대","현대","현대","기타","외식");

   $key = array_search('남서울', $info);
   
   echo $infomapping[$key];

   echo $key;


?>